# Adding Columns

In [1]:
import pandas as pd 

data = {
    "name" : ["ram","shyam","ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,34,22,30,29,40,25,32],
    "salary" :[50000,60000,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,90,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)
df['bonus'] = df['salary']*0.1  #  simple method add column at the last 
print(df)
# using the insert 
df.insert(0,'employee_id',[10,20,30,40,50,60,70,80])
df

        name  age  salary  performance_score
0        ram   28   50000                 85
1      shyam   34   60000                 90
2  ghanshyam   22   45000                 78
3  dhanshyam   30   52000                 92
4      aditi   29   40000                 88
5    jagdish   40   70000                 95
6        raj   25   40000                 80
7     simran   32   50000                 89
        name  age  salary  performance_score   bonus
0        ram   28   50000                 85  5000.0
1      shyam   34   60000                 90  6000.0
2  ghanshyam   22   45000                 78  4500.0
3  dhanshyam   30   52000                 92  5200.0
4      aditi   29   40000                 88  4000.0
5    jagdish   40   70000                 95  7000.0
6        raj   25   40000                 80  4000.0
7     simran   32   50000                 89  5000.0

   employee_id       name  age  salary  performance_score   bonus
0           10        ram   28   50000                 85  5000.0
1           20      shyam   34   60000                 90  6000.0
2           30  ghanshyam   22   45000                 78  4500.0
3           40  dhanshyam   30   52000                 92  5200.0
4           50      aditi   29   40000                 88  4000.0
5           60    jagdish   40   70000                 95  7000.0
6           70        raj   25   40000                 80  4000.0
7           80     simran   32   50000                 89  5000.0

# Updating Values

In [2]:
import pandas as pd 

data = {
    "name" : ["ram","shyam","ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,34,22,30,29,40,25,32],
    "salary" :[50000,60000,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,90,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

# .loc[]
#df.loc[row_index,'column_name'] = new_value

df.loc[0,'salary'] = 55000
df

        name  age  salary  performance_score
0        ram   28   50000                 85
1      shyam   34   60000                 90
2  ghanshyam   22   45000                 78
3  dhanshyam   30   52000                 92
4      aditi   29   40000                 88
5    jagdish   40   70000                 95
6        raj   25   40000                 80
7     simran   32   50000                 89

        name  age  salary  performance_score
0        ram   28   55000                 85
1      shyam   34   60000                 90
2  ghanshyam   22   45000                 78
3  dhanshyam   30   52000                 92
4      aditi   29   40000                 88
5    jagdish   40   70000                 95
6        raj   25   40000                 80
7     simran   32   50000                 89

In [3]:
import pandas as pd 

data = {
    "name" : ["ram","shyam","ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,34,22,30,29,40,25,32],
    "salary" :[50000,60000,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,90,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

df['salary'] = df["salary"]*1.05
df

        name  age  salary  performance_score
0        ram   28   50000                 85
1      shyam   34   60000                 90
2  ghanshyam   22   45000                 78
3  dhanshyam   30   52000                 92
4      aditi   29   40000                 88
5    jagdish   40   70000                 95
6        raj   25   40000                 80
7     simran   32   50000                 89

        name  age   salary  performance_score
0        ram   28  52500.0                 85
1      shyam   34  63000.0                 90
2  ghanshyam   22  47250.0                 78
3  dhanshyam   30  54600.0                 92
4      aditi   29  42000.0                 88
5    jagdish   40  73500.0                 95
6        raj   25  42000.0                 80
7     simran   32  52500.0                 89

# Removing

In [4]:
import pandas as pd 

data = {
    "name" : ["ram","shyam","ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,34,22,30,29,40,25,32],
    "salary" :[50000,60000,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,90,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

# df.drop(columns = ['column_name'] , inplace = True)

df.drop(columns = ['performance_score','age'] , inplace = True)

df

        name  age  salary  performance_score
0        ram   28   50000                 85
1      shyam   34   60000                 90
2  ghanshyam   22   45000                 78
3  dhanshyam   30   52000                 92
4      aditi   29   40000                 88
5    jagdish   40   70000                 95
6        raj   25   40000                 80
7     simran   32   50000                 89

        name  salary
0        ram   50000
1      shyam   60000
2  ghanshyam   45000
3  dhanshyam   52000
4      aditi   40000
5    jagdish   70000
6        raj   40000
7     simran   50000

# Handling  Missing Data

In [27]:
import pandas as pd 

data = {
    "name" : ["ram",None,"ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,None,22,30,29,40,25,32],
    "salary" :[50000,None,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

# NaN for number
# None for object data type

# .isnull()
# true missing value 
# false value is present     

df.isnull()
print(df)
df.isnull().sum()

        name   age   salary  performance_score
0        ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2  ghanshyam  22.0  45000.0               78.0
3  dhanshyam  30.0  52000.0               92.0
4      aditi  29.0  40000.0               88.0
5    jagdish  40.0  70000.0               95.0
6        raj  25.0  40000.0               80.0
7     simran  32.0  50000.0               89.0
        name   age   salary  performance_score
0        ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2  ghanshyam  22.0  45000.0               78.0
3  dhanshyam  30.0  52000.0               92.0
4      aditi  29.0  40000.0               88.0
5    jagdish  40.0  70000.0               95.0
6        raj  25.0  40000.0               80.0
7     simran  32.0  50000.0               89.0

name                 1
age                  1
salary               1
performance_score    1
dtype: int64

In [31]:
import pandas as pd 

data = {
    "name" : ["ram",None,"ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,None,22,30,29,40,25,32],
    "salary" :[50000,None,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

# NaN for number
# None for object data type

# .isnull()
# true missing value 
# false value is present     

df.isnull()

        name   age   salary  performance_score
0        ram  28.0  50000.0               85.0
1       None   NaN      NaN                NaN
2  ghanshyam  22.0  45000.0               78.0
3  dhanshyam  30.0  52000.0               92.0
4      aditi  29.0  40000.0               88.0
5    jagdish  40.0  70000.0               95.0
6        raj  25.0  40000.0               80.0
7     simran  32.0  50000.0               89.0

    name    age  salary  performance_score
0  False  False   False              False
1   True   True    True               True
2  False  False   False              False
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False

In [32]:
import pandas as pd 

data = {
    "name" : ["ram",None,None,"dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,None,22,30,29,40,25,32],
    "salary" :[50000,None,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,20,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
df

# df.dropna(axis=0, inplace=True )  axis=0 for the rows and 1 for the columns

df =df.dropna(axis = 0) # axis = 0 only remove rows
df

df = df.fillna(0,inplace = True)
df

In [7]:
import pandas as pd 

data = {
    "name" : ["ram",None,None,"dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,None,22,30,29,40,25,32],
    "salary" :[50000,None,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,20,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

# df.dropna(axis=0, inplace=True )  axis=0 for the rows and 1 for the columns

df =df.dropna(axis=1) # axis = 0 only remove rows
df

        name   age   salary  performance_score
0        ram  28.0  50000.0                 85
1       None   NaN      NaN                 20
2       None  22.0  45000.0                 78
3  dhanshyam  30.0  52000.0                 92
4      aditi  29.0  40000.0                 88
5    jagdish  40.0  70000.0                 95
6        raj  25.0  40000.0                 80
7     simran  32.0  50000.0                 89

   performance_score
0                 85
1                 20
2                 78
3                 92
4                 88
5                 95
6                 80
7                 89

In [8]:
import pandas as pd 

data = {
    "name" : ["ram",None,None,"dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,None,22,30,29,40,25,32],
    "salary" :[50000,None,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,20,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

# df.dropna(axis=0, inplace=True )  axis=0 for the rows and 1 for the columns

df =df.fillna(0) # axis = 0 only remove rows
df

        name   age   salary  performance_score
0        ram  28.0  50000.0                 85
1       None   NaN      NaN                 20
2       None  22.0  45000.0                 78
3  dhanshyam  30.0  52000.0                 92
4      aditi  29.0  40000.0                 88
5    jagdish  40.0  70000.0                 95
6        raj  25.0  40000.0                 80
7     simran  32.0  50000.0                 89

        name   age   salary  performance_score
0        ram  28.0  50000.0                 85
1          0   0.0      0.0                 20
2          0  22.0  45000.0                 78
3  dhanshyam  30.0  52000.0                 92
4      aditi  29.0  40000.0                 88
5    jagdish  40.0  70000.0                 95
6        raj  25.0  40000.0                 80
7     simran  32.0  50000.0                 89

In [9]:
import pandas as pd 

data = {
    "name" : ["ram",None,None,"dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,None,22,30,29,40,25,32],
    "salary" :[50000,None,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,20,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

df['age'].fillna(df['age'].mean(),inplace=True)
df['salary'].fillna(df['salary'].mean(), inplace = True)
df

        name   age   salary  performance_score
0        ram  28.0  50000.0                 85
1       None   NaN      NaN                 20
2       None  22.0  45000.0                 78
3  dhanshyam  30.0  52000.0                 92
4      aditi  29.0  40000.0                 88
5    jagdish  40.0  70000.0                 95
6        raj  25.0  40000.0                 80
7     simran  32.0  50000.0                 89

C:\Users\abc\AppData\Local\Temp\ipykernel_15352\2984667887.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(),inplace=True)
C:\Users\abc\AppData\Local\Temp\ipykernel_15352\2984667887.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].mean(), inplace = True)

        name        age        salary  performance_score
0        ram  28.000000  50000.000000                 85
1       None  29.428571  49571.428571                 20
2       None  22.000000  45000.000000                 78
3  dhanshyam  30.000000  52000.000000                 92
4      aditi  29.000000  40000.000000                 88
5    jagdish  40.000000  70000.000000                 95
6        raj  25.000000  40000.000000                 80
7     simran  32.000000  50000.000000                 89

In [10]:
# inter polation means entering estimated value in the missing data

# 10 
# 20
# Nan (enter the 30 here inter-polation)
# 40

# here the data integraty,prevent the data loss,smooth trends
# type linear,polynomial,time

import pandas as pd 

data = {
    "name" : ["ram",'shyam',"ghanshyam","dhanshyam","aditi","jagdish","raj","simran"],
    "age" :[28,None,22,30,29,40,25,32],
    "salary" :[50000,None,45000,52000,40000,70000,40000,50000],
    "performance_score" :[85,None,78,92,88,95,80,89]
}

df = pd.DataFrame(data)
print(df)

df.interpolate(method="linear",axis=0,inplace = True)
df

        name   age   salary  performance_score
0        ram  28.0  50000.0               85.0
1      shyam   NaN      NaN                NaN
2  ghanshyam  22.0  45000.0               78.0
3  dhanshyam  30.0  52000.0               92.0
4      aditi  29.0  40000.0               88.0
5    jagdish  40.0  70000.0               95.0
6        raj  25.0  40000.0               80.0
7     simran  32.0  50000.0               89.0

C:\Users\abc\AppData\Local\Temp\ipykernel_15352\1636000372.py:23: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0,inplace = True)

        name   age   salary  performance_score
0        ram  28.0  50000.0               85.0
1      shyam  25.0  47500.0               81.5
2  ghanshyam  22.0  45000.0               78.0
3  dhanshyam  30.0  52000.0               92.0
4      aditi  29.0  40000.0               88.0
5    jagdish  40.0  70000.0               95.0
6        raj  25.0  40000.0               80.0
7     simran  32.0  50000.0               89.0

# Sorting and Aggeration

In [11]:
#df.sort_values(by='column_name,ascending = True/False,inplace = True)

import pandas as pd 

data = {
    'name' : ['arun','varun','karun'],
    'age' :[28,20,32],
    'salary' :[10000,20000,30000]
}

df = pd.DataFrame(data)

df.sort_values(by='age',ascending=False,inplace = True)
df

    name  age  salary
2  karun   32   30000
0   arun   28   10000
1  varun   20   20000

In [12]:
#df.sort_values(by=['column_name','column 2'] ,ascending = [True/False,true/false],inplace = True)

import pandas as pd 

data = {
    'name' : ['arun','varun','karun'],
    'age' :[28,20,32],
    'salary' :[10000,20000,30000]
}

df = pd.DataFrame(data)

df.sort_values(by=['age','salary'],ascending=[True,False],inplace = True)
df

    name  age  salary
1  varun   20   20000
0   arun   28   10000
2  karun   32   30000

In [13]:
'''
df[clmn name],mean()
df[clmn name],sum()
df[clmn name],min()
df[clmn name],max()

'''
import pandas as pd 

data = {
    'name' : ['arun','varun','karun'],
    'age' :[28,20,32],
    'salary' :[10000,20000,30000]
}

df = pd.DataFrame(data)

avg_salary = df['salary'].mean()
avg_salary

np.float64(20000.0)

In [14]:
#grouping 
#  common aggrigation fx  min max sum  std count mean last mai () jarur

import pandas as pd 

data = {
    'name' : ['arun','varun','karun','narun','marun'],
    'age' :[28,34,22,34,28],
    'salary' :[50000,60000,45000,52000,480000]
}

df = pd.DataFrame(data)

grouped = df.groupby('age')['salary'].sum()  
grouped

age
22     45000
28    530000
34    112000
Name: salary, dtype: int64

In [15]:
# multiple column grouping 

import pandas as pd 

data = {
    'name' : ['arun','varun','karun','narun','marun'],
    'age' :[28,34,22,34,28],
    'salary' :[50000,60000,45000,52000,480000]
}

df = pd.DataFrame(data)

grouped = df.groupby(['age','name'])['salary'].sum()
grouped

age  name
22   karun     45000
28   arun      50000
     marun    480000
34   narun     52000
     varun     60000
Name: salary, dtype: int64

In [ ]:
#  common aggrigation fx  min max sum  std count mean last mai () jarur  

# pd.merge(df1,df2,on='clmn name ',how 'type of join ')  there inner outer left right 
import pandas as pd 
df_customer = pd.DataFrame({
    'customerID' : [1,2,3],
    'name' : ['ramesh','suresh','kalpesh']
})

df_orders = pd.DataFrame({
    'customerID':[1,2,4],
    'orderAmount':[250,450,350]
})

df_merge = pd.merge(df_customer,df_orders,on = 'customerID', how='inner')  
df_merge

   customerID    name  orderAmount
0           1  ramesh          250
1           2  suresh          450

In [ ]:
'''   
vertically (row wise)
horizontally(column wise )
pd.concat([df1,df2],axis = 0 ,ignore_index = True)
'''

import pandas as pd 

df1 = pd.DataFrame({
    'customerID' :[1,2],
    'name' : ['ram','shyam']
}) 
df2 = pd.DataFrame({
    'customerID' :[3,4],
    'name' : ['raju','kaju']
}) 

df = pd.concat([df1,df2],axis = 0,ignore_index=True )  # if axis =1 column wise add karega 
df

   customerID   name
0           1    ram
1           2  shyam
2           3   raju
3           4   kaju